## Install and Load Packages

In [1]:
import pandas as pd

In [2]:
!pip install sqlalchemy psycopg2-binary

Requirement already satisfied: sqlalchemy in /Users/jiarui/anaconda3/lib/python3.9/site-packages (1.4.54)
Collecting psycopg2-binary
  Downloading psycopg2_binary-2.9.10-cp39-cp39-macosx_12_0_x86_64.whl.metadata (4.9 kB)
Requirement already satisfied: greenlet!=0.4.17 in /Users/jiarui/anaconda3/lib/python3.9/site-packages (from sqlalchemy) (3.1.1)
Downloading psycopg2_binary-2.9.10-cp39-cp39-macosx_12_0_x86_64.whl (3.0 MB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 3.0/3.0 MB 4.6 MB/s eta 0:00:00a 0:00:01
Installing collected packages: psycopg2-binary
Successfully installed psycopg2-binary-2.9.10

In [3]:
from sqlalchemy import create_engine

## Connect to Engine

In [6]:
engine = create_engine('postgresql://root:root@localhost:5436/ny_taxi')

In [7]:
engine.connect()

In [8]:
# Test db connection
query = """
SELECT 1 as number;
"""

pd.read_sql(query, con=engine)

   number
0       1

In [9]:
# Check available tables
query = """
SELECT *
FROM pg_catalog.pg_tables
WHERE schemaname != 'pg_catalog' AND 
    schemaname != 'information_schema';
"""

pd.read_sql(query, con=engine)

Empty DataFrame
Columns: [schemaname, tablename, tableowner, tablespace, hasindexes, hasrules, hastriggers, rowsecurity]
Index: []

## Upload Data

In [13]:
df1 = pd.read_csv('green_tripdata_2019-10.csv.gz', compression='gzip', low_memory=False)

In [15]:
df2 = pd.read_csv('taxi_zone_lookup.csv')

In [46]:
# Format columns
df1['VendorID'] = pd.to_numeric(df1['VendorID'], errors='coerce').astype('Int64')
df1['RatecodeID'] = pd.to_numeric(df1['RatecodeID'], errors='coerce').astype('Int64')
df1.lpep_pickup_datetime = pd.to_datetime(df1.lpep_pickup_datetime)
df1.lpep_dropoff_datetime = pd.to_datetime(df1.lpep_dropoff_datetime)

In [19]:
df1.head()

,VendorID,lpep_pickup_datetime,lpep_dropoff_datetime,store_and_fwd_flag,RatecodeID,PULocationID,DOLocationID,passenger_count,trip_distance,fare_amount,extra,mta_tax,tip_amount,tolls_amount,ehail_fee,improvement_surcharge,total_amount,payment_type,trip_type,congestion_surcharge
0,2.0,2019-10-01 00:26:02,2019-10-01 00:39:58,N,1.0,112,196,1.0,5.88,18.0,0.50,0.5,0.00,0.0,NaN,0.3,19.30,2.0,1.0,0.0
1,1.0,2019-10-01 00:18:11,2019-10-01 00:22:38,N,1.0,43,263,1.0,0.80,5.0,3.25,0.5,0.00,0.0,NaN,0.3,9.05,2.0,1.0,0.0
2,1.0,2019-10-01 00:09:31,2019-10-01 00:24:47,N,1.0,255,228,2.0,7.50,21.5,0.50,0.5,0.00,0.0,NaN,0.3,22.80,2.0,1.0,0.0
3,1.0,2019-10-01 00:37:40,2019-10-01 00:41:49,N,1.0,181,181,1.0,0.90,5.5,0.50,0.5,0.00,0.0,NaN,0.3,6.80,2.0,1.0,0.0
4,2.0,2019-10-01 00:08:13,2019-10-01 00:17:56,N,1.0,97,188,1.0,2.52,10.0,0.50,0.5,2.26,0.0,NaN,0.3,13.56,1.0,1.0,0.0

In [47]:
print(pd.io.sql.get_schema(df1, name='green_taxi_data', con=engine))

CREATE TABLE green_taxi_data (
	"VendorID" BIGINT,
	lpep_pickup_datetime TIMESTAMP WITHOUT TIME ZONE,
	lpep_dropoff_datetime TIMESTAMP WITHOUT TIME ZONE,
	store_and_fwd_flag TEXT,
	"RatecodeID" BIGINT,
	"PULocationID" BIGINT,
	"DOLocationID" BIGINT,
	passenger_count FLOAT(53),
	trip_distance FLOAT(53),
	fare_amount FLOAT(53),
	extra FLOAT(53),
	mta_tax FLOAT(53),
	tip_amount FLOAT(53),
	tolls_amount FLOAT(53),
	ehail_fee FLOAT(53),
	improvement_surcharge FLOAT(53),
	total_amount FLOAT(53),
	payment_type FLOAT(53),
	trip_type FLOAT(53),
	congestion_surcharge FLOAT(53)
)

In [108]:
# Upload data to engine
df1.to_sql(name='green_taxi_data', con=engine, if_exists='replace', index=False)

386

In [21]:
print(pd.io.sql.get_schema(df2, name='taxi_zone', con=engine))

CREATE TABLE taxi_zone (
	"LocationID" BIGINT,
	"Borough" TEXT,
	"Zone" TEXT,
	service_zone TEXT
)

In [22]:
df2.head()

   LocationID        Borough                     Zone service_zone
0           1            EWR           Newark Airport          EWR
1           2         Queens              Jamaica Bay    Boro Zone
2           3          Bronx  Allerton/Pelham Gardens    Boro Zone
3           4      Manhattan            Alphabet City  Yellow Zone
4           5  Staten Island            Arden Heights    Boro Zone

In [30]:
df2.to_sql(name='taxi_zone', con=engine, if_exists='replace', index=False)

265

In [ ]:
# Check available tables - should have two
query = """
SELECT *
FROM pg_catalog.pg_tables
WHERE schemaname != 'pg_catalog' AND 
    schemaname != 'information_schema';
"""

pd.read_sql(query, con=engine)

,schemaname,tablename,tableowner,tablespace,hasindexes,hasrules,hastriggers,rowsecurity
0,public,taxi_zone,root,None,False,False,False,False
1,public,green_taxi_data,root,None,False,False,False,False

In [50]:
# Test query from db
query = """
SELECT * FROM green_taxi_data LIMIT 10
"""

pd.read_sql(query, con=engine)

,VendorID,lpep_pickup_datetime,lpep_dropoff_datetime,store_and_fwd_flag,RatecodeID,PULocationID,DOLocationID,passenger_count,trip_distance,fare_amount,extra,mta_tax,tip_amount,tolls_amount,ehail_fee,improvement_surcharge,total_amount,payment_type,trip_type,congestion_surcharge
0,2,2019-10-01 00:26:02,2019-10-01 00:39:58,N,1,112,196,1.0,5.88,18.0,0.50,0.5,0.00,0.0,None,0.3,19.30,2.0,1.0,0.0
1,1,2019-10-01 00:18:11,2019-10-01 00:22:38,N,1,43,263,1.0,0.80,5.0,3.25,0.5,0.00,0.0,None,0.3,9.05,2.0,1.0,0.0
2,1,2019-10-01 00:09:31,2019-10-01 00:24:47,N,1,255,228,2.0,7.50,21.5,0.50,0.5,0.00,0.0,None,0.3,22.80,2.0,1.0,0.0
3,1,2019-10-01 00:37:40,2019-10-01 00:41:49,N,1,181,181,1.0,0.90,5.5,0.50,0.5,0.00,0.0,None,0.3,6.80,2.0,1.0,0.0
4,2,2019-10-01 00:08:13,2019-10-01 00:17:56,N,1,97,188,1.0,2.52,10.0,0.50,0.5,2.26,0.0,None,0.3,13.56,1.0,1.0,0.0
5,2,2019-10-01 00:35:01,2019-10-01 00:43:40,N,1,65,49,1.0,1.47,8.0,0.50,0.5,1.86,0.0,None,0.3,11.16,1.0,1.0,0.0
6,1,2019-10-01 00:28:09,2019-10-01 00:30:49,N,1,7,179,1.0,0.60,4.0,0.50,0.5,1.00,0.0,None,0.3,6.30,1.0,1.0,0.0
7,2,2019-10-01 00:28:26,2019-10-01 00:32:01,N,1,41,74,1.0,0.56,4.5,0.50,0.5,0.00,0.0,None,0.3,5.80,2.0,1.0,0.0
8,2,2019-10-01 00:14:01,2019-10-01 00:26:16,N,1,255,49,1.0,2.42,10.5,0.50,0.5,0.00,0.0,None,0.3,11.80,2.0,1.0,0.0
9,1,2019-10-01 00:03:03,2019-10-01 00:17:13,Y,1,130,131,1.0,3.40,13.0,0.50,0.5,2.85,0.0,None,0.3,17.15,1.0,1.0,0.0

## Answer questions

### Q3. Trip segmentation count

In [51]:
mile_criteria = [
    'trip_distance <= 1',
    'trip_distance > 1 AND trip_distance <= 3',
    'trip_distance > 3 AND trip_distance <= 7',
    'trip_distance > 7 AND trip_distance <= 10',
    'trip_distance > 10'
]

In [54]:
count_lst = []
for mile_criterion in mile_criteria:
    query = f"""
    SELECT count(*) FROM green_taxi_data 
    WHERE 
        lpep_pickup_datetime >= '2019-10-01' AND 
        lpep_dropoff_datetime < '2019-11-01' AND
        {mile_criterion}
    """

    count_lst.append(pd.read_sql(query, con=engine).iloc[0, 0])

In [55]:
count_lst

[104802, 198924, 109603, 27678, 35189]

### Q4. Longest trip for each day

In [67]:
query = """
SELECT pickup_date
FROM (
    SELECT pickup_date, row_number() over (order by trip_distance DESC) as distance_rank
    FROM (
        SELECT 
            DATE(lpep_pickup_datetime) as pickup_date, 
            row_number() over (partition by DATE(lpep_pickup_datetime) order by trip_distance DESC) AS daily_rank,
            trip_distance
        FROM green_taxi_data
    ) t1
    WHERE daily_rank = 1
) t2
WHERE distance_rank = 1
"""

pd.read_sql(query, con=engine)

  pickup_date
0  2019-10-31

### Q5. Three biggest pickup zones

In [75]:
## Test
# Double quote for PULocationID is required.
# Otherwise, an error will occur.
query = """
SELECT "PULocationID"
FROM green_taxi_data
LIMIT 10
"""

pd.read_sql(query, con=engine)

   PULocationID
0           112
1            43
2           255
3           181
4            97
5            65
6             7
7            41
8           255
9           130

In [79]:
query = """
WITH filtered_grouped_trips AS (
    SELECT "PULocationID", SUM(total_amount) as total_amount
    FROM green_taxi_data
    WHERE DATE(lpep_pickup_datetime) = '2019-10-18'
    GROUP BY "PULocationID"
    HAVING SUM(total_amount) > 13000
)
SELECT "PULocationID", "Zone", total_amount
FROM filtered_grouped_trips a
LEFT JOIN taxi_zone b
ON a."PULocationID" = b."LocationID"
"""

pd.read_sql(query, con=engine)

   PULocationID                 Zone  total_amount
0            74    East Harlem North      18686.68
1            75    East Harlem South      16797.26
2           166  Morningside Heights      13029.79

### Q6. Largest tip

In [107]:
query = """
SELECT "Zone"
FROM green_taxi_data a
LEFT JOIN taxi_zone b
on a."DOLocationID" = b."LocationID"
WHERE 
    lpep_pickup_datetime >= '2019-10-01' AND
    lpep_pickup_datetime < '2019-11-01' AND
    "PULocationID" = (
        SELECT "LocationID"
        FROM taxi_zone
        WHERE "Zone" = 'East Harlem North'
    )
ORDER BY tip_amount DESC
LIMIT 1
"""

pd.read_sql(query, con=engine)

          Zone
0  JFK Airport